Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DroneInertialMeasurementUnit_LSM6DSV16X/drivers/lsm6dsv16x_reg.h
#define LSM6DSV16X_SLV0_ADD                 0x15U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t rw_0                 : 1;
  uint8_t slave0_add           : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_add           : 7;
  uint8_t rw_0                 : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv0_add_t;

#define LSM6DSV16X_SLV0_SUBADD              0x16U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_reg           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_reg           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv0_subadd_t;

#define LSM6DSV16X_SLV0_CONFIG              0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_numop         : 3;
  uint8_t batch_ext_sens_0_en  : 1;
  uint8_t not_used0            : 1;
  uint8_t shub_odr             : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t shub_odr             : 3;
  uint8_t not_used0            : 1;
  uint8_t batch_ext_sens_0_en  : 1;
  uint8_t slave0_numop         : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv0_config_t;

#define LSM6DSV16X_SLV1_ADD                 0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_1                  : 1;
  uint8_t slave1_add           : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_add           : 7;
  uint8_t r_1                  : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv1_add_t;

#define LSM6DSV16X_SLV1_SUBADD              0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave1_reg           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_reg           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv1_subadd_t;

#define LSM6DSV16X_SLV1_CONFIG              0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave1_numop         : 3;
  uint8_t batch_ext_sens_1_en  : 1;
  uint8_t not_used0            : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0            : 4;
  uint8_t batch_ext_sens_1_en  : 1;
  uint8_t slave1_numop         : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv1_config_t;

#define LSM6DSV16X_SLV2_ADD                 0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_2                  : 1;
  uint8_t slave2_add           : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_add           : 7;
  uint8_t r_2                  : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv2_add_t;

#define LSM6DSV16X_SLV2_SUBADD              0x1CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave2_reg           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_reg           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv2_subadd_t;

#define LSM6DSV16X_SLV2_CONFIG              0x1DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave2_numop         : 3;
  uint8_t batch_ext_sens_2_en  : 1;
  uint8_t not_used0            : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0            : 4;
  uint8_t batch_ext_sens_2_en  : 1;
  uint8_t slave2_numop         : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv2_config_t;

#define LSM6DSV16X_SLV3_ADD                 0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_3                  : 1;
  uint8_t slave3_add           : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_add           : 7;
  uint8_t r_3                  : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv3_add_t;

#define LSM6DSV16X_SLV3_SUBADD              0x1FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_reg           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_reg           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv3_subadd_t;

#define LSM6DSV16X_SLV3_CONFIG              0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_numop         : 3;
  uint8_t batch_ext_sens_3_en  : 1;
  uint8_t not_used0            : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0            : 4;
  uint8_t batch_ext_sens_3_en  : 1;
  uint8_t slave3_numop         : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_slv3_config_t;

#define LSM6DSV16X_DATAWRITE_SLV0           0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_dataw         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_dataw         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_datawrite_slv0_t;

#define LSM6DSV16X_STATUS_MASTER            0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sens_hub_endop       : 1;
  uint8_t not_used0            : 2;
  uint8_t slave0_nack          : 1;
  uint8_t slave1_nack          : 1;
  uint8_t slave2_nack          : 1;
  uint8_t slave3_nack          : 1;
  uint8_t wr_once_done         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wr_once_done         : 1;
  uint8_t slave3_nack          : 1;
  uint8_t slave2_nack          : 1;
  uint8_t slave1_nack          : 1;
  uint8_t slave0_nack          : 1;
  uint8_t not_used0            : 2;
  uint8_t sens_hub_endop       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16x_status_master_t;

/**
  * @}
  *
  */

/**
  * @defgroup LSM6DSO_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lsm6dsv16x_func_cfg_access_t          func_cfg_access;
  lsm6dsv16x_pin_ctrl_t                 pin_ctrl;
  lsm6dsv16x_if_cfg_t                   if_cfg;
  lsm6dsv16x_odr_trig_cfg_t             odr_trig_cfg;
  lsm6dsv16x_fifo_ctrl1_t               fifo_ctrl1;
  lsm6dsv16x_fifo_ctrl2_t               fifo_ctrl2;
  lsm6dsv16x_fifo_ctrl3_t               fifo_ctrl3;
  lsm6dsv16x_fifo_ctrl4_t               fifo_ctrl4;
  lsm6dsv16x_counter_bdr_reg1_t         counter_bdr_reg1;
  lsm6dsv16x_counter_bdr_reg2_t         counter_bdr_reg2;
  lsm6dsv16x_int1_ctrl_t                int1_ctrl;
  lsm6dsv16x_int2_ctrl_t                int2_ctrl;
  lsm6dsv16x_who_am_i_t                 who_am_i;
  lsm6dsv16x_ctrl1_t                    ctrl1;
  lsm6dsv16x_ctrl2_t                    ctrl2;
  lsm6dsv16x_ctrl3_t                    ctrl3;
  lsm6dsv16x_ctrl4_t                    ctrl4;
  lsm6dsv16x_ctrl5_t                    ctrl5;
  lsm6dsv16x_ctrl6_t                    ctrl6;
  lsm6dsv16x_ctrl7_t                    ctrl7;
  lsm6dsv16x_ctrl8_t                    ctrl8;
  lsm6dsv16x_ctrl9_t                    ctrl9;
  lsm6dsv16x_ctrl10_t                   ctrl10;
  lsm6dsv16x_ctrl_status_t              ctrl_status;
  lsm6dsv16x_fifo_status1_t             fifo_status1;
  lsm6dsv16x_fifo_status2_t             fifo_status2;
  lsm6dsv16x_all_int_src_t              all_int_src;
  lsm6dsv16x_status_reg_t               status_reg;
  lsm6dsv16x_out_temp_l_t               out_temp_l;
  lsm6dsv16x_out_temp_h_t               out_temp_h;
  lsm6dsv16x_outx_l_g_t                 outx_l_g;
  lsm6dsv16x_outx_h_g_t                 outx_h_g;
  lsm6dsv16x_outy_l_g_t                 outy_l_g;
  lsm6dsv16x_outy_h_g_t                 outy_h_g;
  lsm6dsv16x_outz_l_g_t                 outz_l_g;
  lsm6dsv16x_outz_h_g_t                 outz_h_g;
  lsm6dsv16x_outx_l_a_t                 outx_l_a;
  lsm6dsv16x_outx_h_a_t                 outx_h_a;
  lsm6dsv16x_outy_l_a_t                 outy_l_a;
  lsm6dsv16x_outy_h_a_t                 outy_h_a;
  lsm6dsv16x_outz_l_a_t                 outz_l_a;
  lsm6dsv16x_outz_h_a_t                 outz_h_a;
  lsm6dsv16x_ui_outx_l_g_ois_eis_t      ui_outx_l_g_ois_eis;
  lsm6dsv16x_ui_outx_h_g_ois_eis_t      ui_outx_h_g_ois_eis;
  lsm6dsv16x_ui_outy_l_g_ois_eis_t      ui_outy_l_g_ois_eis;
  lsm6dsv16x_ui_outy_h_g_ois_eis_t      ui_outy_h_g_ois_eis;
  lsm6dsv16x_ui_outz_l_g_ois_eis_t      ui_outz_l_g_ois_eis;
  lsm6dsv16x_ui_outz_h_g_ois_eis_t      ui_outz_h_g_ois_eis;
  lsm6dsv16x_ui_outx_l_a_ois_dualc_t    ui_outx_l_a_ois_dualc;
  lsm6dsv16x_ui_outx_h_a_ois_dualc_t    ui_outx_h_a_ois_dualc;
  lsm6dsv16x_ui_outy_l_a_ois_dualc_t    ui_outy_l_a_ois_dualc;
  lsm6dsv16x_ui_outy_h_a_ois_dualc_t    ui_outy_h_a_ois_dualc;
  lsm6dsv16x_ui_outz_l_a_ois_dualc_t    ui_outz_l_a_ois_dualc;
  lsm6dsv16x_ui_outz_h_a_ois_dualc_t    ui_outz_h_a_ois_dualc;
  lsm6dsv16x_ah_qvar_out_l_t            ah_qvar_out_l;
  lsm6dsv16x_ah_qvar_out_h_t            ah_qvar_out_h;
  lsm6dsv16x_timestamp0_t               timestamp0;
  lsm6dsv16x_timestamp1_t               timestamp1;
  lsm6dsv16x_timestamp2_t               timestamp2;
  lsm6dsv16x_timestamp3_t               timestamp3;
  lsm6dsv16x_ui_status_reg_ois_t        ui_status_reg_ois;
  lsm6dsv16x_wake_up_src_t              wake_up_src;
  lsm6dsv16x_tap_src_t                  tap_src;
  lsm6dsv16x_d6d_src_t                  d6d_src;
  lsm6dsv16x_status_master_mainpage_t   status_master_mainpage;
  lsm6dsv16x_emb_func_status_mainpage_t emb_func_status_mainpage;
  lsm6dsv16x_fsm_status_mainpage_t      fsm_status_mainpage;
  lsm6dsv16x_mlc_status_mainpage_t      mlc_status_mainpage;
  lsm6dsv16x_internal_freq_t            internal_freq;
  lsm6dsv16x_functions_enable_t         functions_enable;
  lsm6dsv16x_den_t                      den;
  lsm6dsv16x_inactivity_dur_t           inactivity_dur;
  lsm6dsv16x_inactivity_ths_t           inactivity_ths;
  lsm6dsv16x_tap_cfg0_t                 tap_cfg0;
  lsm6dsv16x_tap_cfg1_t                 tap_cfg1;
  lsm6dsv16x_tap_cfg2_t                 tap_cfg2;
  lsm6dsv16x_tap_ths_6d_t               tap_ths_6d;
  lsm6dsv16x_tap_dur_t                  tap_dur;
  lsm6dsv16x_wake_up_ths_t              wake_up_ths;
  lsm6dsv16x_wake_up_dur_t              wake_up_dur;
  lsm6dsv16x_free_fall_t                free_fall;
  lsm6dsv16x_md1_cfg_t                  md1_cfg;
  lsm6dsv16x_md2_cfg_t                  md2_cfg;
  lsm6dsv16x_emb_func_cfg_t             emb_func_cfg;
  lsm6dsv16x_ui_handshake_ctrl_t        ui_handshake_ctrl;
  lsm6dsv16x_ui_spi2_shared_0_t         ui_spi2_shared_0;
  lsm6dsv16x_ui_spi2_shared_1_t         ui_spi2_shared_1;
  lsm6dsv16x_ui_spi2_shared_2_t         ui_spi2_shared_2;
  lsm6dsv16x_ui_spi2_shared_3_t         ui_spi2_shared_3;
  lsm6dsv16x_ui_spi2_shared_4_t         ui_spi2_shared_4;
  lsm6dsv16x_ui_spi2_shared_5_t         ui_spi2_shared_5;
  lsm6dsv16x_ctrl_eis_t                 ctrl_eis;
  lsm6dsv16x_ui_int_ois_t               ui_int_ois;
  lsm6dsv16x_ui_ctrl1_ois_t             ui_ctrl1_ois;
  lsm6dsv16x_ui_ctrl2_ois_t             ui_ctrl2_ois;
  lsm6dsv16x_ui_ctrl3_ois_t             ui_ctrl3_ois;
  lsm6dsv16x_x_ofs_usr_t                x_ofs_usr;
  lsm6dsv16x_y_ofs_usr_t                y_ofs_usr;
  lsm6dsv16x_z_ofs_usr_t                z_ofs_usr;
  lsm6dsv16x_fifo_data_out_tag_t        fifo_data_out_tag;
  lsm6dsv16x_fifo_data_out_x_l_t        fifo_data_out_x_l;
  lsm6dsv16x_fifo_data_out_x_h_t        fifo_data_out_x_h;
  lsm6dsv16x_fifo_data_out_y_l_t        fifo_data_out_y_l;
  lsm6dsv16x_fifo_data_out_y_h_t        fifo_data_out_y_h;
  lsm6dsv16x_fifo_data_out_z_l_t        fifo_data_out_z_l;
  lsm6dsv16x_fifo_data_out_z_h_t        fifo_data_out_z_h;
  lsm6dsv16x_spi2_who_am_i_t            spi2_who_am_i;
  lsm6dsv16x_spi2_status_reg_ois_t      spi2_status_reg_ois;
  lsm6dsv16x_spi2_out_temp_l_t          spi2_out_temp_l;
  lsm6dsv16x_spi2_out_temp_h_t          spi2_out_temp_h;
  lsm6dsv16x_spi2_outx_l_g_ois_t        spi2_outx_l_g_ois;
  lsm6dsv16x_spi2_outx_h_g_ois_t        spi2_outx_h_g_ois;
  lsm6dsv16x_spi2_outy_l_g_ois_t        spi2_outy_l_g_ois;
  lsm6dsv16x_spi2_outy_h_g_ois_t        spi2_outy_h_g_ois;
  lsm6dsv16x_spi2_outz_l_g_ois_t        spi2_outz_l_g_ois;
  lsm6dsv16x_spi2_outz_h_g_ois_t        spi2_outz_h_g_ois;
  lsm6dsv16x_spi2_outx_l_a_ois_t        spi2_outx_l_a_ois;
  lsm6dsv16x_spi2_outx_h_a_ois_t        spi2_outx_h_a_ois;
  lsm6dsv16x_spi2_outy_l_a_ois_t        spi2_outy_l_a_ois;
  lsm6dsv16x_spi2_outy_h_a_ois_t        spi2_outy_h_a_ois;
  lsm6dsv16x_spi2_outz_l_a_ois_t        spi2_outz_l_a_ois;
  lsm6dsv16x_spi2_outz_h_a_ois_t        spi2_outz_h_a_ois;
  lsm6dsv16x_spi2_handshake_ctrl_t      spi2_handshake_ctrl;
  lsm6dsv16x_spi2_int_ois_t             spi2_int_ois;
  lsm6dsv16x_spi2_ctrl1_ois_t           spi2_ctrl1_ois;
  lsm6dsv16x_spi2_ctrl2_ois_t           spi2_ctrl2_ois;
  lsm6dsv16x_spi2_ctrl3_ois_t           spi2_ctrl3_ois;
  lsm6dsv16x_page_sel_t                 page_sel;
  lsm6dsv16x_emb_func_en_a_t            emb_func_en_a;
  lsm6dsv16x_emb_func_en_b_t            emb_func_en_b;
  lsm6dsv16x_emb_func_exec_status_t     emb_func_exec_status;
  lsm6dsv16x_page_address_t             page_address;
  lsm6dsv16x_page_value_t               page_value;
  lsm6dsv16x_emb_func_int1_t            emb_func_int1;
  lsm6dsv16x_fsm_int1_t                 fsm_int1;
  lsm6dsv16x_mlc_int1_t                 mlc_int1;
  lsm6dsv16x_emb_func_int2_t            emb_func_int2;
  lsm6dsv16x_fsm_int2_t                 fsm_int2;
  lsm6dsv16x_mlc_int2_t                 mlc_int2;
  lsm6dsv16x_emb_func_status_t          emb_func_status;
  lsm6dsv16x_fsm_status_t               fsm_status;
  lsm6dsv16x_mlc_status_t               mlc_status;
  lsm6dsv16x_page_rw_t                  page_rw;
  lsm6dsv16x_emb_func_fifo_en_a_t       emb_func_fifo_en_a;
  lsm6dsv16x_emb_func_fifo_en_b_t       emb_func_fifo_en_b;
  lsm6dsv16x_fsm_enable_t               fsm_enable;
  lsm6dsv16x_fsm_long_counter_l_t       fsm_long_counter_l;
  lsm6dsv16x_fsm_long_counter_h_t       fsm_long_counter_h;
  lsm6dsv16x_int_ack_mask_t             int_ack_mask;
  lsm6dsv16x_fsm_outs1_t                fsm_outs1;
  lsm6dsv16x_fsm_outs2_t                fsm_outs2;
  lsm6dsv16x_fsm_outs3_t                fsm_outs3;
  lsm6dsv16x_fsm_outs4_t                fsm_outs4;
  lsm6dsv16x_fsm_outs5_t                fsm_outs5;
  lsm6dsv16x_fsm_outs6_t                fsm_outs6;
  lsm6dsv16x_fsm_outs7_t                fsm_outs7;
  lsm6dsv16x_fsm_outs8_t                fsm_outs8;
  lsm6dsv16x_fsm_odr_t                  fsm_odr;
  lsm6dsv16x_mlc_odr_t                  mlc_odr;
  lsm6dsv16x_step_counter_l_t           step_counter_l;
  lsm6dsv16x_step_counter_h_t           step_counter_h;
  lsm6dsv16x_emb_func_src_t             emb_func_src;
  lsm6dsv16x_emb_func_init_a_t          emb_func_init_a;
  lsm6dsv16x_emb_func_init_b_t          emb_func_init_b;
  lsm6dsv16x_mlc1_src_t                 mlc1_src;
  lsm6dsv16x_mlc2_src_t                 mlc2_src;
  lsm6dsv16x_mlc3_src_t                 mlc3_src;
  lsm6dsv16x_mlc4_src_t                 mlc4_src;
  lsm6dsv16x_fsm_ext_sensitivity_l_t    fsm_ext_sensitivity_l;
  lsm6dsv16x_fsm_ext_sensitivity_h_t    fsm_ext_sensitivity_h;
  lsm6dsv16x_fsm_ext_offx_l_t           fsm_ext_offx_l;
  lsm6dsv16x_fsm_ext_offx_h_t           fsm_ext_offx_h;
  lsm6dsv16x_fsm_ext_offy_l_t           fsm_ext_offy_l;
  lsm6dsv16x_fsm_ext_offy_h_t           fsm_ext_offy_h;
  lsm6dsv16x_fsm_ext_offz_l_t           fsm_ext_offz_l;
  lsm6dsv16x_fsm_ext_offz_h_t           fsm_ext_offz_h;
  lsm6dsv16x_fsm_ext_matrix_xx_l_t      fsm_ext_matrix_xx_l;
  lsm6dsv16x_fsm_ext_matrix_xx_h_t      fsm_ext_matrix_xx_h;
  lsm6dsv16x_fsm_ext_matrix_xy_l_t      fsm_ext_matrix_xy_l;
  lsm6dsv16x_fsm_ext_matrix_xy_h_t      fsm_ext_matrix_xy_h;
  lsm6dsv16x_fsm_ext_matrix_xz_l_t      fsm_ext_matrix_xz_l;
  lsm6dsv16x_fsm_ext_matrix_xz_h_t      fsm_ext_matrix_xz_h;
  lsm6dsv16x_fsm_ext_matrix_yy_l_t      fsm_ext_matrix_yy_l;
  lsm6dsv16x_fsm_ext_matrix_yy_h_t      fsm_ext_matrix_yy_h;
  lsm6dsv16x_fsm_ext_matrix_yz_l_t      fsm_ext_matrix_yz_l;
  lsm6dsv16x_fsm_ext_matrix_yz_h_t      fsm_ext_matrix_yz_h;
  lsm6dsv16x_fsm_ext_matrix_zz_l_t      fsm_ext_matrix_zz_l;
  lsm6dsv16x_fsm_ext_matrix_zz_h_t      fsm_ext_matrix_zz_h;
  lsm6dsv16x_ext_cfg_a_t                ext_cfg_a;
  lsm6dsv16x_ext_cfg_b_t                ext_cfg_b;
  lsm6dsv16x_fsm_lc_timeout_l_t         fsm_lc_timeout_l;
  lsm6dsv16x_fsm_lc_timeout_h_t         fsm_lc_timeout_h;
  lsm6dsv16x_fsm_programs_t             fsm_programs;
  lsm6dsv16x_fsm_start_add_l_t          fsm_start_add_l;
  lsm6dsv16x_fsm_start_add_h_t          fsm_start_add_h;
  lsm6dsv16x_pedo_cmd_reg_t             pedo_cmd_reg;
  lsm6dsv16x_pedo_deb_steps_conf_t      pedo_deb_steps_conf;
  lsm6dsv16x_pedo_sc_deltat_l_t         pedo_sc_deltat_l;
  lsm6dsv16x_pedo_sc_deltat_h_t         pedo_sc_deltat_h;
  lsm6dsv16x_mlc_ext_sensitivity_l_t    mlc_ext_sensitivity_l;
  lsm6dsv16x_mlc_ext_sensitivity_h_t    mlc_ext_sensitivity_h;
  lsm6dsv16x_sensor_hub_1_t             sensor_hub_1;
  lsm6dsv16x_sensor_hub_2_t             sensor_hub_2;
  lsm6dsv16x_sensor_hub_3_t             sensor_hub_3;
  lsm6dsv16x_sensor_hub_4_t             sensor_hub_4;
  lsm6dsv16x_sensor_hub_5_t             sensor_hub_5;
  lsm6dsv16x_sensor_hub_6_t             sensor_hub_6;
  lsm6dsv16x_sensor_hub_7_t             sensor_hub_7;
  lsm6dsv16x_sensor_hub_8_t             sensor_hub_8;
  lsm6dsv16x_sensor_hub_9_t             sensor_hub_9;
  lsm6dsv16x_sensor_hub_10_t            sensor_hub_10;
  lsm6dsv16x_sensor_hub_11_t            sensor_hub_11;
  lsm6dsv16x_sensor_hub_12_t            sensor_hub_12;
  lsm6dsv16x_sensor_hub_13_t            sensor_hub_13;
  lsm6dsv16x_sensor_hub_14_t            sensor_hub_14;
  lsm6dsv16x_sensor_hub_15_t            sensor_hub_15;
  lsm6dsv16x_sensor_hub_16_t            sensor_hub_16;
  lsm6dsv16x_sensor_hub_17_t            sensor_hub_17;
  lsm6dsv16x_sensor_hub_18_t            sensor_hub_18;
  lsm6dsv16x_master_config_t            master_config;
  lsm6dsv16x_slv0_add_t                 slv0_add;
  lsm6dsv16x_slv0_subadd_t              slv0_subadd;
  lsm6dsv16x_slv0_config_t              slv0_config;
  lsm6dsv16x_slv1_add_t                 slv1_add;
  lsm6dsv16x_slv1_subadd_t              slv1_subadd;
  lsm6dsv16x_slv1_config_t              slv1_config;
  lsm6dsv16x_slv2_add_t                 slv2_add;
  lsm6dsv16x_slv2_subadd_t              slv2_subadd;
  lsm6dsv16x_slv2_config_t              slv2_config;
  lsm6dsv16x_slv3_add_t                 slv3_add;
  lsm6dsv16x_slv3_subadd_t              slv3_subadd;
  lsm6dsv16x_slv3_config_t              slv3_config;
  lsm6dsv16x_datawrite_slv0_t           datawrite_slv0;
  lsm6dsv16x_status_master_t            status_master;
  bitwise_t                             bitwise;
  uint8_t                               byte;
} lsm6dsv16x_reg_t;

/**
  * @}
  *
  */

int32_t lsm6dsv16x_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);
int32_t lsm6dsv16x_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);

float lsm6dsv16x_from_sflp_to_mg(int16_t lsb);
float lsm6dsv16x_from_fs2_to_mg(int16_t lsb);
float lsm6dsv16x_from_fs4_to_mg(int16_t lsb);
float lsm6dsv16x_from_fs8_to_mg(int16_t lsb);
float lsm6dsv16x_from_fs16_to_mg(int16_t lsb);

float lsm6dsv16x_from_fs125_to_mdps(int16_t lsb);
float lsm6dsv16x_from_fs500_to_mdps(int16_t lsb);
float lsm6dsv16x_from_fs250_to_mdps(int16_t lsb);
float lsm6dsv16x_from_fs1000_to_mdps(int16_t lsb);
float lsm6dsv16x_from_fs2000_to_mdps(int16_t lsb);
float lsm6dsv16x_from_fs4000_to_mdps(int16_t lsb);

float lsm6dsv16x_from_lsb_to_celsius(int16_t lsb);

float lsm6dsv16x_from_lsb_to_nsec(uint32_t lsb);

