Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DroneInertialMeasurementUnit_LSM6DSV16X/drivers/lsm6dsv16x_reg.h
int32_t lsm6dsv16x_acceleration_raw_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16x_dual_acceleration_raw_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16x_ois_dual_acceleration_raw_get(stmdev_ctx_t *ctx,
                                                 int16_t *val);

int32_t lsm6dsv16x_ah_qvar_raw_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16x_odr_cal_reg_get(stmdev_ctx_t *ctx, int8_t *val);

int32_t lsm6dsv16x_ln_pg_write(stmdev_ctx_t *ctx, uint16_t address,
                               uint8_t *buf, uint8_t len);
int32_t lsm6dsv16x_ln_pg_read(stmdev_ctx_t *ctx, uint16_t address, uint8_t *buf,
                              uint8_t len);

int32_t lsm6dsv16x_emb_function_dbg_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_emb_function_dbg_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_DEN_ACT_LOW  = 0x0,
  LSM6DSV16X_DEN_ACT_HIGH = 0x1,
} lsm6dsv16x_den_polarity_t;
int32_t lsm6dsv16x_den_polarity_set(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_den_polarity_t val);
int32_t lsm6dsv16x_den_polarity_get(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_den_polarity_t *val);

typedef struct
{
  uint8_t stamp_in_gy_data     : 1;
  uint8_t stamp_in_xl_data     : 1;
  uint8_t den_x                : 1;
  uint8_t den_y                : 1;
  uint8_t den_z                : 1;
  enum
  {
    DEN_NOT_DEFINED = 0x00,
    LEVEL_TRIGGER   = 0x02,
    LEVEL_LATCHED   = 0x03,
  } mode;
} lsm6dsv16x_den_conf_t;
int32_t lsm6dsv16x_den_conf_set(stmdev_ctx_t *ctx, lsm6dsv16x_den_conf_t val);
int32_t lsm6dsv16x_den_conf_get(stmdev_ctx_t *ctx, lsm6dsv16x_den_conf_t *val);

typedef enum
{
  LSM6DSV16X_EIS_125dps  = 0x0,
  LSM6DSV16X_EIS_250dps  = 0x1,
  LSM6DSV16X_EIS_500dps  = 0x2,
  LSM6DSV16X_EIS_1000dps = 0x3,
  LSM6DSV16X_EIS_2000dps = 0x4,
} lsm6dsv16x_eis_gy_full_scale_t;
int32_t lsm6dsv16x_eis_gy_full_scale_set(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_eis_gy_full_scale_t val);
int32_t lsm6dsv16x_eis_gy_full_scale_get(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_eis_gy_full_scale_t *val);

int32_t lsm6dsv16x_eis_gy_on_spi2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_eis_gy_on_spi2_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_EIS_ODR_OFF = 0x0,
  LSM6DSV16X_EIS_1920Hz  = 0x1,
  LSM6DSV16X_EIS_960Hz   = 0x2,
} lsm6dsv16x_gy_eis_data_rate_t;
int32_t lsm6dsv16x_gy_eis_data_rate_set(stmdev_ctx_t *ctx,
                                        lsm6dsv16x_gy_eis_data_rate_t val);
int32_t lsm6dsv16x_gy_eis_data_rate_get(stmdev_ctx_t *ctx,
                                        lsm6dsv16x_gy_eis_data_rate_t *val);

int32_t lsm6dsv16x_fifo_watermark_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_watermark_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_fifo_xl_dual_fsm_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_xl_dual_fsm_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_CMP_DISABLE = 0x0,
  LSM6DSV16X_CMP_8_TO_1  = 0x1,
  LSM6DSV16X_CMP_16_TO_1 = 0x2,
  LSM6DSV16X_CMP_32_TO_1 = 0x3,
} lsm6dsv16x_fifo_compress_algo_t;
int32_t lsm6dsv16x_fifo_compress_algo_set(stmdev_ctx_t *ctx,
                                          lsm6dsv16x_fifo_compress_algo_t val);
int32_t lsm6dsv16x_fifo_compress_algo_get(stmdev_ctx_t *ctx,
                                          lsm6dsv16x_fifo_compress_algo_t *val);

int32_t lsm6dsv16x_fifo_virtual_sens_odr_chg_set(stmdev_ctx_t *ctx,
                                                 uint8_t val);
int32_t lsm6dsv16x_fifo_virtual_sens_odr_chg_get(stmdev_ctx_t *ctx,
                                                 uint8_t *val);

int32_t lsm6dsv16x_fifo_compress_algo_real_time_set(stmdev_ctx_t *ctx,
                                                    uint8_t val);
int32_t lsm6dsv16x_fifo_compress_algo_real_time_get(stmdev_ctx_t *ctx,
                                                    uint8_t *val);

int32_t lsm6dsv16x_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_XL_NOT_BATCHED       = 0x0,
  LSM6DSV16X_XL_BATCHED_AT_1Hz875 = 0x1,
  LSM6DSV16X_XL_BATCHED_AT_7Hz5   = 0x2,
  LSM6DSV16X_XL_BATCHED_AT_15Hz   = 0x3,
  LSM6DSV16X_XL_BATCHED_AT_30Hz   = 0x4,
  LSM6DSV16X_XL_BATCHED_AT_60Hz   = 0x5,
  LSM6DSV16X_XL_BATCHED_AT_120Hz  = 0x6,
  LSM6DSV16X_XL_BATCHED_AT_240Hz  = 0x7,
  LSM6DSV16X_XL_BATCHED_AT_480Hz  = 0x8,
  LSM6DSV16X_XL_BATCHED_AT_960Hz  = 0x9,
  LSM6DSV16X_XL_BATCHED_AT_1920Hz = 0xa,
  LSM6DSV16X_XL_BATCHED_AT_3840Hz = 0xb,
  LSM6DSV16X_XL_BATCHED_AT_7680Hz = 0xc,
} lsm6dsv16x_fifo_xl_batch_t;
int32_t lsm6dsv16x_fifo_xl_batch_set(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_fifo_xl_batch_t val);
int32_t lsm6dsv16x_fifo_xl_batch_get(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_fifo_xl_batch_t *val);

typedef enum
{
  LSM6DSV16X_GY_NOT_BATCHED       = 0x0,
  LSM6DSV16X_GY_BATCHED_AT_1Hz875 = 0x1,
  LSM6DSV16X_GY_BATCHED_AT_7Hz5   = 0x2,
  LSM6DSV16X_GY_BATCHED_AT_15Hz   = 0x3,
  LSM6DSV16X_GY_BATCHED_AT_30Hz   = 0x4,
  LSM6DSV16X_GY_BATCHED_AT_60Hz   = 0x5,
  LSM6DSV16X_GY_BATCHED_AT_120Hz  = 0x6,
  LSM6DSV16X_GY_BATCHED_AT_240Hz  = 0x7,
  LSM6DSV16X_GY_BATCHED_AT_480Hz  = 0x8,
  LSM6DSV16X_GY_BATCHED_AT_960Hz  = 0x9,
  LSM6DSV16X_GY_BATCHED_AT_1920Hz = 0xa,
  LSM6DSV16X_GY_BATCHED_AT_3840Hz = 0xb,
  LSM6DSV16X_GY_BATCHED_AT_7680Hz = 0xc,
} lsm6dsv16x_fifo_gy_batch_t;
int32_t lsm6dsv16x_fifo_gy_batch_set(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_fifo_gy_batch_t val);
int32_t lsm6dsv16x_fifo_gy_batch_get(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_fifo_gy_batch_t *val);

typedef enum
{
  LSM6DSV16X_BYPASS_MODE             = 0x0,
  LSM6DSV16X_FIFO_MODE               = 0x1,
  LSM6DSV16X_STREAM_WTM_TO_FULL_MODE = 0x2,
  LSM6DSV16X_STREAM_TO_FIFO_MODE     = 0x3,
  LSM6DSV16X_BYPASS_TO_STREAM_MODE   = 0x4,
  LSM6DSV16X_STREAM_MODE             = 0x6,
  LSM6DSV16X_BYPASS_TO_FIFO_MODE     = 0x7,
} lsm6dsv16x_fifo_mode_t;
