Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DroneInertialMeasurementUnit_LSM6DSV16X/drivers/lsm6dsv16x_reg.h
typedef enum
{
  LSM6DSV16X_SH_TRG_XL_GY_DRDY = 0x0,
  LSM6DSV16X_SH_TRIG_INT2      = 0x1,
} lsm6dsv16x_sh_syncro_mode_t;
int32_t lsm6dsv16x_sh_syncro_mode_set(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_sh_syncro_mode_t val);
int32_t lsm6dsv16x_sh_syncro_mode_get(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_sh_syncro_mode_t *val);

typedef enum
{
  LSM6DSV16X_EACH_SH_CYCLE    = 0x0,
  LSM6DSV16X_ONLY_FIRST_CYCLE = 0x1,
} lsm6dsv16x_sh_write_mode_t;
int32_t lsm6dsv16x_sh_write_mode_set(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_sh_write_mode_t val);
int32_t lsm6dsv16x_sh_write_mode_get(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_sh_write_mode_t *val);

int32_t lsm6dsv16x_sh_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_sh_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dsv16x_sh_cfg_write_t;
int32_t lsm6dsv16x_sh_cfg_write(stmdev_ctx_t *ctx,
                                lsm6dsv16x_sh_cfg_write_t *val);
typedef enum
{
  LSM6DSV16X_SH_15Hz  = 0x1,
  LSM6DSV16X_SH_30Hz  = 0x2,
  LSM6DSV16X_SH_60Hz  = 0x3,
  LSM6DSV16X_SH_120Hz = 0x4,
  LSM6DSV16X_SH_240Hz = 0x5,
  LSM6DSV16X_SH_480Hz = 0x6,
} lsm6dsv16x_sh_data_rate_t;
int32_t lsm6dsv16x_sh_data_rate_set(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_sh_data_rate_t val);
int32_t lsm6dsv16x_sh_data_rate_get(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_sh_data_rate_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dsv16x_sh_cfg_read_t;
int32_t lsm6dsv16x_sh_slv0_cfg_read(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_sh_cfg_read_t *val);
int32_t lsm6dsv16x_sh_slv1_cfg_read(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_sh_cfg_read_t *val);
int32_t lsm6dsv16x_sh_slv2_cfg_read(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_sh_cfg_read_t *val);
int32_t lsm6dsv16x_sh_slv3_cfg_read(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_sh_cfg_read_t *val);


int32_t lsm6dsv16x_ui_sdo_pull_up_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_ui_sdo_pull_up_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_I2C_I3C_ENABLE  = 0x0,
  LSM6DSV16X_I2C_I3C_DISABLE = 0x1,
} lsm6dsv16x_ui_i2c_i3c_mode_t;
int32_t lsm6dsv16x_ui_i2c_i3c_mode_set(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_ui_i2c_i3c_mode_t val);
int32_t lsm6dsv16x_ui_i2c_i3c_mode_get(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_ui_i2c_i3c_mode_t *val);

typedef enum
{
  LSM6DSV16X_SPI_4_WIRE = 0x0,
  LSM6DSV16X_SPI_3_WIRE = 0x1,
} lsm6dsv16x_spi_mode_t;
int32_t lsm6dsv16x_spi_mode_set(stmdev_ctx_t *ctx, lsm6dsv16x_spi_mode_t val);
int32_t lsm6dsv16x_spi_mode_get(stmdev_ctx_t *ctx, lsm6dsv16x_spi_mode_t *val);

int32_t lsm6dsv16x_ui_sda_pull_up_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_ui_sda_pull_up_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_SPI2_4_WIRE = 0x0,
  LSM6DSV16X_SPI2_3_WIRE = 0x1,
} lsm6dsv16x_spi2_mode_t;
int32_t lsm6dsv16x_spi2_mode_set(stmdev_ctx_t *ctx, lsm6dsv16x_spi2_mode_t val);
int32_t lsm6dsv16x_spi2_mode_get(stmdev_ctx_t *ctx,
                                 lsm6dsv16x_spi2_mode_t *val);

int32_t lsm6dsv16x_sigmot_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_sigmot_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t step_counter_enable  : 1;
  uint8_t false_step_rej       : 1;
} lsm6dsv16x_stpcnt_mode_t;
int32_t lsm6dsv16x_stpcnt_mode_set(stmdev_ctx_t *ctx,
                                   lsm6dsv16x_stpcnt_mode_t val);
int32_t lsm6dsv16x_stpcnt_mode_get(stmdev_ctx_t *ctx,
                                   lsm6dsv16x_stpcnt_mode_t *val);

int32_t lsm6dsv16x_stpcnt_steps_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16x_stpcnt_rst_step_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_stpcnt_rst_step_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_stpcnt_debounce_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_stpcnt_debounce_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_stpcnt_period_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16x_stpcnt_period_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16x_sflp_game_rotation_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_sflp_game_rotation_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  float gbias_x; /* dps */
  float gbias_y; /* dps */
  float gbias_z; /* dps */
} lsm6dsv16x_sflp_gbias_t;
int32_t lsm6dsv16x_sflp_game_gbias_set(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_sflp_gbias_t *val);

typedef enum
{
  LSM6DSV16X_SFLP_15Hz  = 0x0,
  LSM6DSV16X_SFLP_30Hz  = 0x1,
  LSM6DSV16X_SFLP_60Hz  = 0x2,
  LSM6DSV16X_SFLP_120Hz = 0x3,
  LSM6DSV16X_SFLP_240Hz = 0x4,
  LSM6DSV16X_SFLP_480Hz = 0x5,
} lsm6dsv16x_sflp_data_rate_t;
int32_t lsm6dsv16x_sflp_data_rate_set(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_sflp_data_rate_t val);
int32_t lsm6dsv16x_sflp_data_rate_get(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_sflp_data_rate_t *val);

typedef struct
{
  uint8_t tap_x_en             : 1;
  uint8_t tap_y_en             : 1;
  uint8_t tap_z_en             : 1;
} lsm6dsv16x_tap_detection_t;
int32_t lsm6dsv16x_tap_detection_set(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_tap_detection_t val);
int32_t lsm6dsv16x_tap_detection_get(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_tap_detection_t *val);

typedef struct
{
  uint8_t x                    : 5;
  uint8_t y                    : 5;
  uint8_t z                    : 5;
} lsm6dsv16x_tap_thresholds_t;
int32_t lsm6dsv16x_tap_thresholds_set(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_tap_thresholds_t val);
int32_t lsm6dsv16x_tap_thresholds_get(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_tap_thresholds_t *val);

