Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DroneInertialMeasurementUnit_LSM6DSV16X/drivers/lsm6dsv16x_reg.h
typedef enum
{
  LSM6DSV16X_XYZ  = 0x0,
  LSM6DSV16X_YXZ  = 0x1,
  LSM6DSV16X_XZY  = 0x2,
  LSM6DSV16X_ZYX  = 0x3,
  LSM6DSV16X_YZX  = 0x5,
  LSM6DSV16X_ZXY  = 0x6,
} lsm6dsv16x_tap_axis_priority_t;
int32_t lsm6dsv16x_tap_axis_priority_set(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_tap_axis_priority_t val);
int32_t lsm6dsv16x_tap_axis_priority_get(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_tap_axis_priority_t *val);

typedef struct
{
  uint8_t shock                : 2;
  uint8_t quiet                : 2;
  uint8_t tap_gap              : 4;
} lsm6dsv16x_tap_time_windows_t;
int32_t lsm6dsv16x_tap_time_windows_set(stmdev_ctx_t *ctx,
                                        lsm6dsv16x_tap_time_windows_t val);
int32_t lsm6dsv16x_tap_time_windows_get(stmdev_ctx_t *ctx,
                                        lsm6dsv16x_tap_time_windows_t *val);

typedef enum
{
  LSM6DSV16X_ONLY_SINGLE        = 0x0,
  LSM6DSV16X_BOTH_SINGLE_DOUBLE = 0x1,
} lsm6dsv16x_tap_mode_t;
int32_t lsm6dsv16x_tap_mode_set(stmdev_ctx_t *ctx, lsm6dsv16x_tap_mode_t val);
int32_t lsm6dsv16x_tap_mode_get(stmdev_ctx_t *ctx, lsm6dsv16x_tap_mode_t *val);

int32_t lsm6dsv16x_tilt_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_tilt_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_timestamp_raw_get(stmdev_ctx_t *ctx, uint32_t *val);

int32_t lsm6dsv16x_timestamp_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_timestamp_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_XL_AND_GY_NOT_AFFECTED       = 0x0,
  LSM6DSV16X_XL_LOW_POWER_GY_NOT_AFFECTED = 0x1,
  LSM6DSV16X_XL_LOW_POWER_GY_SLEEP        = 0x2,
  LSM6DSV16X_XL_LOW_POWER_GY_POWER_DOWN   = 0x3,
} lsm6dsv16x_act_mode_t;
int32_t lsm6dsv16x_act_mode_set(stmdev_ctx_t *ctx, lsm6dsv16x_act_mode_t val);
int32_t lsm6dsv16x_act_mode_get(stmdev_ctx_t *ctx, lsm6dsv16x_act_mode_t *val);

typedef enum
{
  LSM6DSV16X_SLEEP_TO_ACT_AT_1ST_SAMPLE = 0x0,
  LSM6DSV16X_SLEEP_TO_ACT_AT_2ND_SAMPLE = 0x1,
  LSM6DSV16X_SLEEP_TO_ACT_AT_3RD_SAMPLE = 0x2,
  LSM6DSV16X_SLEEP_TO_ACT_AT_4th_SAMPLE = 0x3,
} lsm6dsv16x_act_from_sleep_to_act_dur_t;
int32_t lsm6dsv16x_act_from_sleep_to_act_dur_set(stmdev_ctx_t *ctx,
                                                 lsm6dsv16x_act_from_sleep_to_act_dur_t val);
int32_t lsm6dsv16x_act_from_sleep_to_act_dur_get(stmdev_ctx_t *ctx,
                                                 lsm6dsv16x_act_from_sleep_to_act_dur_t *val);

typedef enum
{
  LSM6DSV16X_1Hz875 = 0x0,
  LSM6DSV16X_15Hz   = 0x1,
  LSM6DSV16X_30Hz   = 0x2,
  LSM6DSV16X_60Hz   = 0x3,
} lsm6dsv16x_act_sleep_xl_odr_t;
int32_t lsm6dsv16x_act_sleep_xl_odr_set(stmdev_ctx_t *ctx,
                                        lsm6dsv16x_act_sleep_xl_odr_t val);
int32_t lsm6dsv16x_act_sleep_xl_odr_get(stmdev_ctx_t *ctx,
                                        lsm6dsv16x_act_sleep_xl_odr_t *val);

typedef struct
{
  lsm6dsv16x_inactivity_dur_t inactivity_cfg;
  uint8_t inactivity_ths;
  uint8_t threshold;
  uint8_t duration;
} lsm6dsv16x_act_thresholds_t;
int32_t lsm6dsv16x_act_thresholds_set(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_act_thresholds_t *val);
int32_t lsm6dsv16x_act_thresholds_get(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_act_thresholds_t *val);

typedef struct
{
  uint8_t shock                : 2;
  uint8_t quiet                : 4;
} lsm6dsv16x_act_wkup_time_windows_t;
int32_t lsm6dsv16x_act_wkup_time_windows_set(stmdev_ctx_t *ctx,
                                             lsm6dsv16x_act_wkup_time_windows_t val);
int32_t lsm6dsv16x_act_wkup_time_windows_get(stmdev_ctx_t *ctx,
                                             lsm6dsv16x_act_wkup_time_windows_t *val);

/**
  * @}
  *
  */

#endif /*LSM6DSV16X_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
